public class Main {
    public static void main(String[] args) {
        int ticketprice = 10_000; // стоимость билета
        int bonus1mile = 20; // Количество рублей для одной бонусной мили


        System.out.println(("Количество бонусных миль:") + ticketprice / bonus1mile);
        
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
